Dr-RegEx/contest2026_497_nitelabu/workspace/openvela-untracked/nuttx/arch/risc-v/src/esp32s31/hardware/esp32s31_otg.h
#define ESP32S31_OTG_DIEP_OFFSET(n)      (0x0900 + ((n) << 5))
#define ESP32S31_OTG_DIEPCTL_EPOFFSET    0x0000 /* Device endpoint control register */
#define ESP32S31_OTG_DIEPINT_EPOFFSET    0x0008 /* Device endpoint interrupt register */
#define ESP32S31_OTG_DIEPTSIZ_EPOFFSET   0x0010 /* Device IN endpoint transfer size register */
#define ESP32S31_OTG_DTXFSTS_EPOFFSET    0x0018 /* Device IN endpoint transmit FIFO status register */

#define ESP32S31_OTG_DIEPCTL_OFFSET(n)   (0x0900 + ((n) << 5))

#define ESP32S31_OTG_DIEPINT_OFFSET(n)   (0x0908 + ((n) << 5))

#define ESP32S31_OTG_DIEPTSIZ_OFFSET(n)  (0x910 + ((n) << 5))

#define ESP32S31_OTG_DTXFSTS_OFFSET(n)   (0x0918 + ((n) << 5))

#define ESP32S31_OTG_DOEP_OFFSET(n)      (0x0b00 + ((n) << 5))
#define ESP32S31_OTG_DOEPCTL_EPOFFSET    0x0000 /* Device control OUT endpoint 0 control register */
#define ESP32S31_OTG_DOEPINT_EPOFFSET    0x0008 /* Device endpoint-x interrupt register */

#define ESP32S31_OTG_DOEPCTL_OFFSET(n)   (0x0b00 + ((n) << 5))

#define ESP32S31_OTG_DOEPINT_OFFSET(n)   (0x0b08 + ((n) << 5))

#define ESP32S31_OTG_DOEPTSIZ_OFFSET(n)  (0x0b10 + ((n) << 5))

/* Power and clock gating registers */

#define ESP32S31_OTG_PCGCCTL_OFFSET      0x0e00 /* Power and clock gating control register */

/* Data FIFO (DFIFO) access registers */

#define ESP32S31_OTG_DFIFO_DEP_OFFSET(n) (0x1000 + ((n) << 12))
#define ESP32S31_OTG_DFIFO_HCH_OFFSET(n) (0x1000 + ((n) << 12))

/* Register Addresses *******************************************************/

#define ESP32S31_OTG_GOTGCTL             (DR_REG_USB_BASE+ESP32S31_OTG_GOTGCTL_OFFSET)
#define ESP32S31_OTG_GOTGINT             (DR_REG_USB_BASE+ESP32S31_OTG_GOTGINT_OFFSET)
#define ESP32S31_OTG_GAHBCFG             (DR_REG_USB_BASE+ESP32S31_OTG_GAHBCFG_OFFSET)
#define ESP32S31_OTG_GUSBCFG             (DR_REG_USB_BASE+ESP32S31_OTG_GUSBCFG_OFFSET)
#define ESP32S31_OTG_GRSTCTL             (DR_REG_USB_BASE+ESP32S31_OTG_GRSTCTL_OFFSET)
#define ESP32S31_OTG_GINTSTS             (DR_REG_USB_BASE+ESP32S31_OTG_GINTSTS_OFFSET)
#define ESP32S31_OTG_GINTMSK             (DR_REG_USB_BASE+ESP32S31_OTG_GINTMSK_OFFSET)
#define ESP32S31_OTG_GRXSTSR             (DR_REG_USB_BASE+ESP32S31_OTG_GRXSTSR_OFFSET)
#define ESP32S31_OTG_GRXSTSP             (DR_REG_USB_BASE+ESP32S31_OTG_GRXSTSP_OFFSET)
#define ESP32S31_OTG_GRXFSIZ             (DR_REG_USB_BASE+ESP32S31_OTG_GRXFSIZ_OFFSET)
#define ESP32S31_OTG_HNPTXFSIZ           (DR_REG_USB_BASE+ESP32S31_OTG_HNPTXFSIZ_OFFSET)
#define ESP32S31_OTG_DIEPTXF0            (DR_REG_USB_BASE+ESP32S31_OTG_DIEPTXF0_OFFSET)
#define ESP32S31_OTG_HNPTXSTS            (DR_REG_USB_BASE+ESP32S31_OTG_HNPTXSTS_OFFSET)
#define ESP32S31_OTG_GCCFG               (DR_REG_USB_BASE+ESP32S31_OTG_GCCFG_OFFSET)
#define ESP32S31_OTG_GSNPSID             (DR_REG_USB_BASE+ESP32S31_OTG_GSNPSID_OFFSET)
#define ESP32S31_OTG_CID                 ESP32S31_OTG_GSNPSID /* Legacy alias */
#define ESP32S31_OTG_HPTXFSIZ            (DR_REG_USB_BASE+ESP32S31_OTG_HPTXFSIZ_OFFSET)

#define ESP32S31_OTG_DIEPTXF(n)          (DR_REG_USB_BASE+ESP32S31_OTG_DIEPTXF_OFFSET(n))

/* Host-mode control and status registers */

#define ESP32S31_OTG_HCFG                (DR_REG_USB_BASE+ESP32S31_OTG_HCFG_OFFSET)
#define ESP32S31_OTG_HFIR                (DR_REG_USB_BASE+ESP32S31_OTG_HFIR_OFFSET)
#define ESP32S31_OTG_HFNUM               (DR_REG_USB_BASE+ESP32S31_OTG_HFNUM_OFFSET)
#define ESP32S31_OTG_HPTXSTS             (DR_REG_USB_BASE+ESP32S31_OTG_HPTXSTS_OFFSET)
#define ESP32S31_OTG_HAINT               (DR_REG_USB_BASE+ESP32S31_OTG_HAINT_OFFSET)
#define ESP32S31_OTG_HAINTMSK            (DR_REG_USB_BASE+ESP32S31_OTG_HAINTMSK_OFFSET)
#define ESP32S31_OTG_HPRT                (DR_REG_USB_BASE+ESP32S31_OTG_HPRT_OFFSET)

#define ESP32S31_OTG_CHAN(n)             (DR_REG_USB_BASE+ESP32S31_OTG_CHAN_OFFSET(n))

#define ESP32S31_OTG_HCCHAR(n)           (DR_REG_USB_BASE+ESP32S31_OTG_HCCHAR_OFFSET(n))

#define ESP32S31_OTG_HCINT(n)            (DR_REG_USB_BASE+ESP32S31_OTG_HCINT_OFFSET(n))

#define ESP32S31_OTG_HCINTMSK(n)         (DR_REG_USB_BASE+ESP32S31_OTG_HCINTMSK_OFFSET(n))

#define ESP32S31_OTG_HCTSIZ(n)           (DR_REG_USB_BASE+ESP32S31_OTG_HCTSIZ_OFFSET(n))

/* Device-mode control and status registers */

#define ESP32S31_OTG_DCFG                (DR_REG_USB_BASE+ESP32S31_OTG_DCFG_OFFSET)
#define ESP32S31_OTG_DCTL                (DR_REG_USB_BASE+ESP32S31_OTG_DCTL_OFFSET)
#define ESP32S31_OTG_DSTS                (DR_REG_USB_BASE+ESP32S31_OTG_DSTS_OFFSET)
#define ESP32S31_OTG_DIEPMSK             (DR_REG_USB_BASE+ESP32S31_OTG_DIEPMSK_OFFSET)
#define ESP32S31_OTG_DOEPMSK             (DR_REG_USB_BASE+ESP32S31_OTG_DOEPMSK_OFFSET)
#define ESP32S31_OTG_DAINT               (DR_REG_USB_BASE+ESP32S31_OTG_DAINT_OFFSET)
#define ESP32S31_OTG_DAINTMSK            (DR_REG_USB_BASE+ESP32S31_OTG_DAINTMSK_OFFSET)
#define ESP32S31_OTG_DVBUSDIS            (DR_REG_USB_BASE+ESP32S31_OTG_DVBUSDIS_OFFSET)
#define ESP32S31_OTG_DVBUSPULSE          (DR_REG_USB_BASE+ESP32S31_OTG_DVBUSPULSE_OFFSET)
#define ESP32S31_OTG_DIEPEMPMSK          (DR_REG_USB_BASE+ESP32S31_OTG_DIEPEMPMSK_OFFSET)

#define ESP32S31_OTG_DIEP(n)             (DR_REG_USB_BASE+ESP32S31_OTG_DIEP_OFFSET(n))

#define ESP32S31_OTG_DIEPCTL(n)          (DR_REG_USB_BASE+ESP32S31_OTG_DIEPCTL_OFFSET(n))

#define ESP32S31_OTG_DIEPINT(n)          (DR_REG_USB_BASE+ESP32S31_OTG_DIEPINT_OFFSET(n))

#define ESP32S31_OTG_DIEPTSIZ(n)         (DR_REG_USB_BASE+ESP32S31_OTG_DIEPTSIZ_OFFSET(n))

#define ESP32S31_OTG_DTXFSTS(n)          (DR_REG_USB_BASE+ESP32S31_OTG_DTXFSTS_OFFSET(n))

#define ESP32S31_OTG_DOEP(n)             (DR_REG_USB_BASE+ESP32S31_OTG_DOEP_OFFSET(n))

#define ESP32S31_OTG_DOEPCTL(n)          (DR_REG_USB_BASE+ESP32S31_OTG_DOEPCTL_OFFSET(n))

#define ESP32S31_OTG_DOEPINT(n)          (DR_REG_USB_BASE+ESP32S31_OTG_DOEPINT_OFFSET(n))

#define ESP32S31_OTG_DOEPTSIZ(n)         (DR_REG_USB_BASE+ESP32S31_OTG_DOEPTSIZ_OFFSET(n))

/* Power and clock gating registers */

#define ESP32S31_OTG_PCGCCTL             (DR_REG_USB_BASE+ESP32S31_OTG_PCGCCTL_OFFSET)

/* Data FIFO (DFIFO) access registers */

#define ESP32S31_OTG_DFIFO_DEP(n)        (DR_REG_USB_BASE+ESP32S31_OTG_DFIFO_DEP_OFFSET(n))
#define ESP32S31_OTG_DFIFO_HCH(n)        (DR_REG_USB_BASE+ESP32S31_OTG_DFIFO_HCH_OFFSET(n))

/* USB PHY Registers */

#define ESP32S31_USBPHYC_PLL1            (ESP32S31_USBPHYC_BASE+ESP32S31_USBPHYC_PLL1_OFFSET)
#define ESP32S31_USBPHYC_TUNE            (ESP32S31_USBPHYC_BASE+ESP32S31_USBPHYC_TUNE_OFFSET)
#define ESP32S31_USBPHYC_LDO             (ESP32S31_USBPHYC_BASE+ESP32S31_USBPHYC_LDO_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* Core global control and status registers */

/* Control and status register */

#define OTG_GOTGCTL_SRQSCS            (1 << 0)  /* Bit 0:  Session request success */
#define OTG_GOTGCTL_SRQ               (1 << 1)  /* Bit 1:  Session request */
#define OTG_GOTGCTL_VBVALOEN          (1 << 2)  /* Bit 2:  VBUS valid override enable */
#define OTG_GOTGCTL_VBVALOVAL         (1 << 3)  /* Bit 3:  VBUS valid override value */
#define OTG_GOTGCTL_AVALOEN           (1 << 4)  /* Bit 4:  A-peripheral session valid override enable */
#define OTG_GOTGCTL_AVALOVAL          (1 << 5)  /* Bit 5:  A-peripheral session valid override value */
#define OTG_GOTGCTL_BVALOEN           (1 << 6)  /* Bit 6:  B-peripheral session valid override enable */
#define OTG_GOTGCTL_BVALOVAL          (1 << 7)  /* Bit 7:  B-peripheral session valid override value  */
#define OTG_GOTGCTL_HNGSCS            (1 << 8)  /* Bit 8:  Host negotiation success */
#define OTG_GOTGCTL_HNPRQ             (1 << 9)  /* Bit 9:  HNP request */
#define OTG_GOTGCTL_HSHNPEN           (1 << 10) /* Bit 10: host set HNP enable */
#define OTG_GOTGCTL_DHNPEN            (1 << 11) /* Bit 11: Device HNP enabled */
#define OTG_GOTGCTL_EHEN              (1 << 12) /* Bit 12: Embedded host enable */
                                                /* Bits 13-15: Reserved, must be kept at reset value */
#define OTG_GOTGCTL_CIDSTS            (1 << 16) /* Bit 16: Connector ID status */
#define OTG_GOTGCTL_DBCT              (1 << 17) /* Bit 17: Long/short debounce time */
#define OTG_GOTGCTL_ASVLD             (1 << 18) /* Bit 18: A-session valid */
#define OTG_GOTGCTL_BSVLD             (1 << 19) /* Bit 19: B-session valid */
#define OTG_GOTGCTL_OTGVER            (1 << 20) /* Bit 20: OTG version */
                                                /* Bits 21-31: Reserved, must be kept at reset value */

